openmv/openmv/src/omv/stm32f407_hal_msp.c
#include "pincfg.h"
#include <stm32f4xx_hal.h>

/* LED GPIOs */
const gpio_t led_pins[] = {
    {LED_PORT, LED_RED_PIN},
    {LED_PORT, LED_GREEN_PIN},
    {LED_PORT, LED_BLUE_PIN},
};

/* DCMI GPIOs */
static const gpio_t dcmi_pins[] = {
    {DCMI_D0_PORT, DCMI_D0_PIN},
    {DCMI_D1_PORT, DCMI_D1_PIN},
    {DCMI_D2_PORT, DCMI_D2_PIN},
    {DCMI_D3_PORT, DCMI_D3_PIN},
    {DCMI_D4_PORT, DCMI_D4_PIN},
    {DCMI_D5_PORT, DCMI_D5_PIN},
    {DCMI_D6_PORT, DCMI_D6_PIN},
    {DCMI_D7_PORT, DCMI_D7_PIN},
    {DCMI_HSYNC_PORT, DCMI_HSYNC_PIN},
    {DCMI_VSYNC_PORT, DCMI_VSYNC_PIN},
    {DCMI_PXCLK_PORT, DCMI_PXCLK_PIN},
};

#define NUM_LED_PINS    (sizeof(led_pins)/sizeof(led_pins[0]))
#define NUM_DCMI_PINS   (sizeof(dcmi_pins)/sizeof(dcmi_pins[0]))

void SystemClock_Config(void);

void HAL_MspInit(void)
{
    /* Set the system clock */
    SystemClock_Config();

    /* Enable GPIO clocks */
    __GPIOA_CLK_ENABLE();
    __GPIOB_CLK_ENABLE();
    __GPIOC_CLK_ENABLE();
    __GPIOD_CLK_ENABLE();
    __GPIOE_CLK_ENABLE();

    /* Enable DMA clocks */
    __DMA2_CLK_ENABLE();

    /* Enable the CCM RAM */
    __CCMDATARAMEN_CLK_ENABLE();

    /* Conigure DCMI GPIO */
    GPIO_InitTypeDef  GPIO_InitStructure;
    GPIO_InitStructure.Pull  = GPIO_PULLDOWN;
    GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
    GPIO_InitStructure.Mode  = GPIO_MODE_OUTPUT_PP;

    GPIO_InitStructure.Pin = DCMI_RESET_PIN;
    HAL_GPIO_Init(DCMI_RESET_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = DCMI_PWDN_PIN;
    HAL_GPIO_Init(DCMI_PWDN_PORT, &GPIO_InitStructure);

    /* Configure LED GPIO */
    GPIO_InitStructure.Pull  = GPIO_NOPULL;
    GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
    GPIO_InitStructure.Mode  = GPIO_MODE_OUTPUT_PP;
    for (int i=0; i<NUM_LED_PINS; i++) {
        HAL_GPIO_WritePin(led_pins[i].port,
                led_pins[i].pin, GPIO_PIN_SET);

        GPIO_InitStructure.Pin = led_pins[i].pin;
        HAL_GPIO_Init(led_pins[i].port, &GPIO_InitStructure);
    }

    /* Configure SD CD PIN */
    GPIO_InitStructure.Pin      = SD_CD_PIN;
    GPIO_InitStructure.Pull     = GPIO_NOPULL;
    GPIO_InitStructure.Speed    = GPIO_SPEED_LOW;
    GPIO_InitStructure.Mode     = GPIO_MODE_INPUT;
    HAL_GPIO_Init(SD_CD_PORT, &GPIO_InitStructure);
}

void HAL_I2C_MspInit(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->Instance == SCCB_I2C) {
        /* Enable I2C clock */
        SCCB_CLK_ENABLE();

        /* Configure SCCB GPIOs */
        GPIO_InitTypeDef GPIO_InitStructure;
        GPIO_InitStructure.Pull      = GPIO_NOPULL;
        GPIO_InitStructure.Speed     = GPIO_SPEED_LOW;
        GPIO_InitStructure.Mode      = GPIO_MODE_AF_OD;
        GPIO_InitStructure.Alternate = SCCB_AF;

        GPIO_InitStructure.Pin = SCCB_SCL_PIN;
        HAL_GPIO_Init(SCCB_PORT, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = SCCB_SDA_PIN;
        HAL_GPIO_Init(SCCB_PORT, &GPIO_InitStructure);
    }
}

void HAL_I2C_MspDeInit(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->Instance == SCCB_I2C) {
        HAL_I2C_DeInit(hi2c);
        SCCB_CLK_DISABLE();
    }
}

void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == DCMI_TIM) {
        /* Enable DCMI timer clock */
        DCMI_TIM_CLK_ENABLE();

        /* Timer GPIO configuration */
        GPIO_InitTypeDef  GPIO_InitStructure;
        GPIO_InitStructure.Pin       = DCMI_TIM_PIN;
        GPIO_InitStructure.Pull      = GPIO_NOPULL;
        GPIO_InitStructure.Speed     = GPIO_SPEED_LOW;
        GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
        GPIO_InitStructure.Alternate = DCMI_TIM_AF;
        HAL_GPIO_Init(DCMI_TIM_PORT, &GPIO_InitStructure);
    }
}

void HAL_DCMI_MspInit(DCMI_HandleTypeDef* hdcmi)
{
    /* DCMI clock enable */
    __DCMI_CLK_ENABLE();

    /* DCMI GPIOs configuration */
    GPIO_InitTypeDef  GPIO_InitStructure;
    GPIO_InitStructure.Pull      = GPIO_PULLDOWN;
    GPIO_InitStructure.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Alternate = GPIO_AF13_DCMI;

    for (int i=0; i<NUM_DCMI_PINS; i++) {
        GPIO_InitStructure.Pin = dcmi_pins[i].pin;
        HAL_GPIO_Init(dcmi_pins[i].port, &GPIO_InitStructure);
    }
}

void HAL_SPI_MspInit(SPI_HandleTypeDef *hspi)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    if (hspi->Instance == SD_SPI) {
            /* Enable clock */
            SD_SPI_CLK_ENABLE();

            /* Configure SPI GPIOs */
            GPIO_InitStructure.Pull      = GPIO_NOPULL;
            GPIO_InitStructure.Speed     = GPIO_SPEED_MEDIUM;
            GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
            GPIO_InitStructure.Alternate = SD_SPI_AF;

            GPIO_InitStructure.Pin = SD_MOSI_PIN;
            HAL_GPIO_Init(SD_MOSI_PORT, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = SD_MISO_PIN;
            HAL_GPIO_Init(SD_MISO_PORT, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = SD_SCLK_PIN;
            HAL_GPIO_Init(SD_SCLK_PORT, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = SD_CS_PIN;
            GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
            HAL_GPIO_Init(SD_CS_PORT, &GPIO_InitStructure);

            /* De-select the Card: Chip Select high */
            SD_DESELECT();

    } else if (hspi->Instance == WLAN_SPI) {
            /* Enable clock */
            WLAN_SPI_CLK_ENABLE();

            /* Configure WLAN EN */
            GPIO_InitStructure.Pin      = WLAN_EN_PIN;
            GPIO_InitStructure.Pull     = GPIO_PULLDOWN;
            GPIO_InitStructure.Speed    = GPIO_SPEED_LOW;
            GPIO_InitStructure.Mode     = GPIO_MODE_OUTPUT_PP;
            HAL_GPIO_Init(WLAN_EN_PORT, &GPIO_InitStructure);

            /* Disable wlan */
            __WLAN_DISABLE();

            /* Configure WLAN IRQ */
            GPIO_InitStructure.Pin      = WLAN_IRQ_PIN;
            GPIO_InitStructure.Pull     = GPIO_PULLUP;
            GPIO_InitStructure.Speed    = GPIO_SPEED_LOW;
            GPIO_InitStructure.Mode     = GPIO_MODE_IT_FALLING;
            HAL_GPIO_Init(WLAN_IRQ_PORT, &GPIO_InitStructure);

            /* Configure WLAN SPI GPIOs */
            GPIO_InitStructure.Pull      = GPIO_PULLUP;
            GPIO_InitStructure.Speed     = GPIO_SPEED_MEDIUM;
            GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
            GPIO_InitStructure.Alternate = WLAN_SPI_AF;

            GPIO_InitStructure.Pin = WLAN_MOSI_PIN;
            HAL_GPIO_Init(WLAN_MOSI_PORT, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = WLAN_MISO_PIN;
            HAL_GPIO_Init(WLAN_MISO_PORT, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = WLAN_SCLK_PIN;
            HAL_GPIO_Init(WLAN_SCLK_PORT, &GPIO_InitStructure);

            GPIO_InitStructure.Pin  = WLAN_CS_PIN;
            GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
            HAL_GPIO_Init(WLAN_CS_PORT, &GPIO_InitStructure);

            /* Deselect the CC3K CS */
            WLAN_DESELECT();
    }
}

void HAL_MspDeInit(void)
{

}
